app/controllers/api/posts_controller.rb

def create
  @post = Post.new(post_params)
  @post.author_id = current_user.id
  if @post.save
---
INSERT INTO "posts" ("title", "body", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Try try"], ["body", "done"], ["author_id", 14], ["created_at", "2021-02-13 01:09:47.007055"], ["updated_at", "2021-02-13 01:09:47.007055"]]

def update
  @post = Post.find(params[:post][:id])
  if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "test"], ["updated_at", "2021-02-17 06:27:56.385277"], ["id", 67]]