app/views/api/posts/index.json.jbuilder

SELECT "posts".* FROM "posts"
---
  @posts.each do |post|
      post.subposts.each do |subpost|